// {
// array = ["Ddd", 3, [98, "Eex,"]];
// array = [["awdd ", ["esw"]], ["qwdc", ["eaw"]]];

// // console.log(JSON.parse(`["Ddd",3,[98,"Eex,"]]`));


// function arrToString3(arr) {
//     str3 = [`[`];

//     for(let i = 0; i < arr.length; i++) {
//         if(typeof arr[i] != "object") {
//             typeof arr[i] == "string"? str3.push(`"${arr[i]}"`) : str3.push(arr[i]);
//         }
//         i < arr.length - 1? str3.push(", ") : "";
//     }
//     str3.push(`]`);
//     return str3.join("");
// }

// function arrToString2(arr) {
//     str2 = [`[`];

//     for(let i = 0; i < arr.length; i++) {
//         if(typeof arr[i] != "object") {
//             typeof arr[i] == "string"? str2.push(`"${arr[i]}"`) : str2.push(arr[i]);
//         } else {
//             str2.push(arrToString3(arr[i]));
//         }
//         i < arr.length - 1? str2.push(", ") : "";
//     }
//     str2.push(`]`);
//     return str2.join("");
// }

// function arrToString(arr) {
//     str = [`[`];

//     for(let i = 0; i < arr.length; i++) {
//         if(typeof arr[i] != "object") {
//             typeof arr[i] == "string"? str.push(`"${arr[i]}"`) : str.push(arr[i]);
//         } else {
//             str.push(arrToString2(arr[i]));
//         }

//         i < arr.length - 1? str.push(", ") : "";
//     }
//     str.push(`]`);
    
//     return str.join("");
// }

// console.log(arrToString(array));

// console.log(11111);
// let as = setInterval(() => {
//     if(1 == 1) {
//         console.log(333333333333);
//         clearInterval(as);
//     }
//     // break;
// })
// console.log(22222);
// }

let n1 = "ah ho ra";
let n2 = "ah ra";

function removeFromArr(arr,index,item = null) {
    arr = JSON.stringify(arr);
    arr = JSON.parse(arr);
    
    let turn;
    
    if(item != null) {
        index = arr.indexOf(item);
    }
    
    if(index <= arr.length-1 && index > -1) {
        arr.splice(index, 1);
        turn = arr;
    } else {
        turn = arr;
    }
    
    return turn;
}

// function mutualNames(n1, n2, options = 0) {// 
//     n1 = n1.trim().split(" ");
//     n2 = n2.trim().split(" ");
    
//     let n1Length = n1.length;
//     let sameStart = n1[0] == n2[0];
//     let notDiff = [];
//     for(let i = 0; i < n1Length; i++) {
//         if(n1.length > 0 && n2.length > 0) {
//             console.log(i, n1, n2);
//             if(n1[i] == n2[i] && i < n1.length) {
//                 notDiff.push(n1[i]);
//                 n1 = removeFromArr(n1, i);
//                 n2 = removeFromArr(n2, i);
//                 i--;
//             } else if(i < n1.length) {
//                 for(let j = 0; j < n2.length; j++) {
//                     if(n1[i] == n2[j]) {
//                         notDiff.push(n1[i]);
//                         n1 = removeFromArr(n1, i);
//                         n2 = removeFromArr(n2, j);
//                         i--;
//                     }
//                 }
//             }
//         }
//     }

//     sameName = false;
//     notDiff.length >= 2 && sameStart? sameName = true : "";
//     return options == 0? sameName : `[${JSON.stringify(n1)}, ${JSON.stringify(n2)}, ${JSON.stringify(notDiff)}]`;
// }

function mutualNames(n1, n2, options=0) {// 
    n1 = n1.toLowerCase().trim().split(" ");
    n2 = n2.toLowerCase().trim().split(" ");
    let newN1 = n1.trim().toLowerCase().split(" ");
    let newN2 = n2.trim().toLowerCase().split(" ");

    console.log(n1, newN1);
}
// console.log(mutualNames("Adam Jibreel Janab", "Adam Kamal Perjessy"));

function randomNum (fromN, toN) {
    return Math.floor(Math.random() * (toN - fromN + 1) + fromN);
}

function f(x) {
    res = 1;

    i = x;
    while(i > 0) {
        res *= i;
        i--;
    }

    return res;
}
// let r = 4;
// console.log(f(r));
// console.log(r);

function toRadian(degrees) {
    return (degrees * Math.PI) / 180;
}

function p(n, m) {
    while(m > 1) {
        n*= n;
        m--;
    }

    return n;
}

function sin(x, n = 100) {
    // sin x = x − x3/3! + x5/5! − x7/7! + ...
    x = toRadian(x);
    let res = x;
    let reS = `${x}`;

    let i = 3;
    let a = 0;
    while(a < n) {
        res -= - ((p(x,i))/(f(i)));
        reS = reS  + ` - ${x}^${i}/(${i}!)`;
        i = i + 2;
        
        res += ((p(x,i))/(f(i)));
        reS = reS  + ` + ${x}^${i}/(${i}!)`;
        i = i + 2;

        a++;
    }

    return [res, reS];
}

let z = 45;
let n = 1;
// console.log(sin(z, n)[1]);
// console.log(sin(z, n)[0]);
// console.log(Math.sin(toRadian(z)).toFixed(2));








let longTxt = `
السَّلام عليكم...
0:08
في هذه الحلقة نُقيِّم معًا أهمَّ أركان ما يُعرَف بنظريَّة التَّطور لدارون.
0:13
تشارلز دارون "Charles Darwin"هو باحثٌ إنجليزيٌّ في تاريخ الأحياء الطَّبيعيِّ،
0:17
ذكَر مشاهداتٍ كثيرةً جَمَعها في رحلاته ونقلها عن آخرين؛
0:21
كالتَّشابه الشَّكليِّ والتَّشريحيِّ بين أنواعٍ مختلفةٍ من الكائنات،
0:25
وأنماطِ توزُّعها الجغرافيِّ،
0:27
وبنى عليها افتراض أنَّ كلَّ الكائنات الحيَّة أتت من أصلٍ مشتركٍ؛
0:31
مرَّ بعمليَّات تطوُّرٍ وتنوُّعٍ،
0:33
بحيث يتغيَّر الكائن تغيُّراتٍ بسيطةً متراكمةً، ثُمَّ الطَّبيعةُ تُغربِل؛
0:38
فالتَّغيُّراتُ المفيدة تُبقيها الطَّبيعة وينتُج عنها نوعٌ جديدٌ من الكائنات
0:43
بمرور آلاف وملايين السِّنين!
0:45
بينما قَضَتِ الطَّبيعة -حسب دارون- على عددٍ لا حصر له من الكائنات الانتقاليَّة
0:51
الَّتي حدثت فيها تغيُّراتٌ ضارَّةٌ أو غير نافعةٍ.
0:55
بالإضافة إلى دور الغربلة،
0:57
افترض دارون أنَّ الطَّبيعة أسهمت في إحداث صفاتٍ جديدةٍ في الكائنات؛
1:02
بحيث عندما يكتسب الحيوان صفاتٍ مُعيَّنةً -نتيجة بيئته-
1:06
فإنَّه يُورِّث هذه الصِّفات إلى أولاده، مُتَّفقًا بذلك مع افتراض لامارك "Lamarck"
1:11
أنَّ الزَّرافة الَّتي تمتاز برقبةٍ عاليةٍ جدًّا
1:14
كانت -في يوم من الأيَّام- برقبةٍ قصيرةٍ،
1:18
ولكن مع تغيُّر الظُّروف الطَّبيعيَّة من حولها
1:21
واضطرارها لمدِّ عنقها حتَّى تأكل من أعلى الشَّجر
1:25
ظلَّ عنقها يستطيل جيلًا من بعد جيلٍ، حتَّى صارت إلى ما صارت إليه اليوم.
1:31
أهمُّ ما في الموضوع
1:33
أنَّ دارون افترض أنَّ الكائنات الحيَّة
1:36
إنّما نتجت عن هذه التَّغيُّرات بمجموع الصُّدف؛
1:39
يعني دون قصد.. دون قصد!
1:42
وبتعبيره: "لم يكن هناك خطَّةٌ للخَلْق"
1:44
(بالإنجليزية) خطَّة الخلق "plan of creation"
1:48
في إيجاد هذه الأنواع الكثيرة، وهو ما أكَّده في مواضع عديدةٍ من كتاباته.
1:54
نشر دارون أفكاره هذه عام 1859م
1:58
في كتابٍ بعنوان: (حول أصل الأنواع) (On the Origin of Species)
2:03
ثمَّ أراد أن يُعطي آليَّةً تفصيليَّةً لتوارثِ الصِّفات المكتسَبة
2:06
فنشر بعد أعوامٍ من كتابه (أصل الأنواع)
2:09
فرضيَّته الَّتي سمَّاها (بالإنجليزية) شموليَّة التَّخلُّق "pangenesis"؛
2:12
والَّتي افترض فيها أنَّ الطَّبيعة عندما تؤثِّر على خلايا الكائن
2:16
فإنَّ هذه الخلايا الجسميَّة تُفرز موادَّ صغيرةً سمَّاها دارون: جيمولز "Gemmules"
2:21
والَّتي تتركَّز في الأعضاء التَّناسليَّة للكائن لتنتقل إلى ذرِّيَّته.
2:26
ومن أين جاء الأصل المشترك يا دارون؟!
2:29
من أين جاء الكائن الأوَّل؛ الَّذي بَنَيْتَ عليه أفكارك،
2:32
ونَسبت إليه الكائنات الحيَّة كلَّها؟!
2:34
لم يُبيِّن دارون في كتابه!
2:36
لكنَّه نصَّ في مراسلاته مع عالِم النَّبات جوزيف دالتون هكر "Joseph Dalton Hooker"
2:41
على أنَّ رؤيته هي:
2:44
أنَّ أوَّل كائنٍ نشأ في بِركةٍ دافئةٍ من عوامل كالضُّوء والحرارة والكهرباء.
2:48
يعني دارون اتَّفق بذلك مع فكرة "التَّوالُد الذَّاتي"
2:51
الَّتي كانت شائعةً في عصره؛
2:54
حيث كان يُظَنُّ أنَّ الكائنات الحيَّة يمكن أن تتشكَّل تلقائيًّا من الجمادات.
3:00
كان يُظَنُّ -مثلًا- أنَّ الحشرات تنشأ من بقايا الطَّعام،
3:03
وأنَّ يَرَقات الذُّباب تنشأ من قِطع اللَّحم المتعفِّنة.
3:08
هذه -باختصارٍ- هي أركان نظريَّة التَّطوُّر لدارون:
3:13
كائنٌ حيٌّ تولَّد بطريقةٍ ما من الجمادات،
3:17
طبيعةٌ تُكسِب الكائن صفاتٍ جديدةً يمكن أن تحوِّلَه من نوعٍ لآخر،
3:24
الصِّفات المكتسَبة تُورَّث،
3:26
والطَّبيعة تَنتخِب بشكلٍ تراكميٍّ؛ وصولًا إلى كائناتٍ أرقى،
3:31
فتُركِّب نُظُمًا حيويَّةً معقَّدةً من تغيُّراتٍ بسيطةٍ متعاقِبةٍ،
3:37
والاستنتاج أنَّ الكائنات الحيَّة نشأت (بالإنجليزية) "evolved"
3:42
دون قصدٍ ولا إرادةٍ مِن فاعلٍ مُريدٍ مختارٍ يعلم ما يفعل.
3:47
وعلى هذه الطَّاولة حمَّل دارون كلَّ ما في الكون من كائناتٍ حيَّةٍ.
3:53
والآن...ما هو التَّقييم العام لتلك الأركان الَّتي بنى عليها دارون هذه النَّتيجة؟
3:59
أمَّا تولُّد الكائنات الحيَّة تلقائيًّا من الجمادات؛ فخرافةٌ سقطت بتجارب
4:05
أشهرُها تجربة فرانسيسكو ريدي "Francesco Redi" قبل دارون بقرنين،
4:09
وتجربة لويس باستور "Louis Pasteur" الَّتي نُشرت بعد كتاب دارون بخمس سنواتٍ،
4:13
والَّتي أثبت فيها أنَّ الكائنات
4:16
الَّتي كان يُعتقد أنَّها تولَّدت ذاتيًّا من الجمادات كبقايا الطَّعام
4:21
إنَّما أتت من خارج الموادِّ الغذائيَّة مع الهواء الملوَّث بها.
4:25
وإلى باستور هذا تُنسب عمليَّة التَّعقيم "البَسْتَرة"، والحليب المبْستَر.
4:29
والحقيقة أنَّ التَّولُّد الذَّاتيَّ ساقطٌ عقلًا أصلًا؛
4:33
أن تتصوَّر كائنًا حيًّا ينشأ هكذا تلقائيًّا من الجمادات!
4:38
ومع ذلك أصرُّوا أن يجرِّبوا!
4:40
جرَّبوا... فسقطت الخرافة بالعلم التَّجريبيِّ، بالإضافة إلى العقل.
4:46
وأمَّا إحداث الطَّبيعة لصفاتٍ جديدةٍ في الكائن عن طريق الاستعمال والإهمال
4:51
كمثال "رقبة الزَّرافة"؛ فخرافةٌ سقطت أيضًا باكتشافات غريغور مندل "Gregor Mendel" (غريغور)
4:56
والَّذي أثبت -بعد دارون بسنواتٍ-
4:59
أنَّ الصِّفات الوراثيَّة للأبناء -مهما تعدَّدت-
5:02
فهي لن تَخرُج عن الموجود -أصلًا- في الآباء
5:07
وسقطت كذلك باكتشافات الوراثة فوق الجينيَّة (بالإنجليزية) "epigenetics"؛
5:11
الَّتي بيَّنت أنَّ العوامل الخارجيَّة والبيئيَّة
5:14
يمكن أن تُغيِّر طريقة قراءة المادَّة الوراثيَّة في كائنٍ ما؛
5:18
لتفعيل صفةٍ كانت كامنةً أو إخماد صفةٍ كانت منشَّطةً،
5:23
لكنَّها لا تُضيف مادَّةً وراثيَّةً لم تكن موجودةً أصلًا.
5:29
وأمَّا توريث الصِّفات المكتسَبة؛ فخرافةٌ ساقطةٌ بالمشاهدة العاديَّة؛
5:34
فعضلات الحدَّاد والنَّجَّار-مثلًا- والَّتي اكتسباها في حياتهما؛لا تُورَّث إلى الأبناء
5:39
ومع ذلك؛ أصرَّ أتباع دارون أن يجرِّبوا!
5:43
جرَّبوا... وظلَّ فايزمن "Weismann" يقطع ذيول 19 جيلًا من الفئران
5:48
ليُفاجأَ المسكين -بعد طولِ تعبٍ- بولادة أبنائها -كلَّ مرَّةٍ- بذيولٍ من جديد!
5:55
يعني لم تنتقل الصِّفة المكتسبة وهي الذَّيل المقطوع إلى الأبناء.
6:01
ماذا بقي من نظريَّة دارون إذن؟!
6:04
ستقول: الانتخاب الطَّبيعيُّ صحيح!
6:07
فأقول لك: القَدْرُ الصَّحيح منه ليس من اختراع دارون، ولا من بنات أفكاره؛
6:13
فالكلُّ يعلم أنَّ الحيوان الأضعف سيكون من الصَّعب عليه
6:17
التَّكيُّف مع الظُّروف البيئيَّة الصَّعبة!
6:20
لكنَّ الانتخاب الطَّبيعيَّ عند دارون تجاوز ذلك
6:23
ليعني -أيضًا- إحداث نُظمٍ حيويّةٍ معقَّدةٍ
6:27
من تغيُّراتٍ بسيطةٍ متعاقبةٍ صُدفيَّةٍ.
6:31
وحتَّى تفهم ماذا يعني الانتخاب الطَّبيعيُّ لدارون؟
6:34
فإنَّ خيال دارون الواسع جاء له بفكرة
6:38
أنَّ الطَّبيعة والاستعمال والإهمال؛ أنتجت للكائنات القديمة تراكيب جسميَّةً بسيطة
6:44
يمكن أن تكون خدمت الكائن في شيءٍ ما،
6:48
فأبقى عليها الانتخاب الطَّبيعيُّ والَّذي لم يكن يعلم أنَّ تراكم هذه التَّراكيب
6:53
سيُنتج عضوًا كاملًا متكاملًا كالجناح للطَّائر، أو العين للحيوان.
6:59
حتَّى تفهم منطق دارون في ذلك تصوَّر أرضًا مليئةً بالخردة،
7:04
يمرُّ عليها أعدادٌ كبيرةٌ من العُميان، ويلتقط كلٌّ منهم قطعة خردةٍ عشوائيًّا،
7:11
ثمَّ يدخل إلى مبنًى كبيرٍ يُغلَق بابه بعد كلِّ داخل.
7:16
مرَّت ملايين السِّنين، والعُميان يلتقطون الخردوات، ويموتون فيُدفنون تحت أرض المبنى.
7:24
فتحتَ أنت بوَّابة المبنى يومًا ما، فاندفعت من البوَّابة طائرة بوينج "Boeing" عملاقة
7:30
يقودها أحد العميان وحلَّق بها في السَّماء!
7:34
تساءلْتَ أنت: كيف تمكَّن الأعمى من صُنع الطَّائرة؟!
7:38
فقيل لك: لم يقصد أن يصنعها!
7:40
إنَّما الَّذي حصل مع العميان قبله
7:43
أنَّ مَن التقط منهم قطعة خردةٍ نافعةٍ له؛ صَمَد وورَّثها لمن خَلْفه!
7:48
فمنهم من التقط قماشةً التحف بها من البرد،
7:51
وآخر التقط مسطَّحًا حديديًّا استظلَّ به من الشَّمس،
7:55
وثالثٌ التقط من الخردة مِقوَد طائرةٍ حرَّك بها طعامه أثناء طبخه،
8:00
ورابعٌ التقط زجاجةً اتَّخذها درعًا في حربه مع أعدائه من العميان!
8:04
وهؤلاء جاؤوا على أزمنةٍ متعاقبةٍ، وورَّثوا قِطَعَهم لمن خلفهم،
8:09
وكانت القِطَع تتركَّب من غير قصدٍ، ولا بفِعل فاعلٍ،
8:13
حتَّى تشكَّلت منها هذه الطَّائرة العظيمة الَّتي رأيت!
8:17
فإيَّاك، ثمَّ إيَّاك أن تتوهَّم أنَّ أحدًا قصد أن تتشكَّل طائرةٌ أو تطير!
8:24
بنفس المنطق؛ اعتبر دارون أنَّ الانتخاب الطَّبيعيَّ
8:28
رقَّع تراكيب الكائنات الحيَّة على عمًى؛
8:32
فأجنحة الطُّيور -مثلًا-
8:33
مُساعَدتُها للطَّير على الطَّيران؛ (بالإنجليزية) "pseudopurpose"
8:36
يعني هدفٌ وهميٌّ، وليس حقيقيًّا!
8:39
والعين إبصارها هدفٌ وهميٌّ؛
8:41
لأنَّه ليس هناك فاعلٌ مريدٌ مختارٌ قَصَد أن تُبصِر العين، أو يُرفرِف الجناح،
8:47
بل جاء هذا كلُّه بتراكمات الصُّدف العمياء!
8:50
هذه هي نُكتة الانتخاب الطَّبيعيِّ الأعمى الَّتي خرج علينا بها دارون،
8:55
وهي -بالإضافة إلى سخافتها لكلِّ عقلٍ سليم-
8:59
فإنَّ الاكتشافات العلميَّة أثبتت استحالتها مع وجود التَّعقيد غير القابل للاختِزال
9:05
أو ما يُعرف (بالإنجليزية) بال"irreducible complexity"
9:08
في كلِّ تفاصيل الكائنات وعلاقاتها؛
9:12
أي أنَّ تراكيب وأعضاء الكائنات الحيَّة بالغةُ التَّعقيد والتَّكامل،
9:17
بحيث لا يمكنها أن تتواجَد إلَّا بتوافُر أجزائها في وقتٍ واحدٍ
9:22
وإلَّا لن تؤدِّي وظيفتها،
9:25
وبذلك فهي غير قابلةٍ لفكرة التَّكوُّن بتدرُّجٍ أبدًا،
9:30
حتَّى على مستوى أصغر وِحدةٍ حيَّة؛
9:33
الخليَّة الَّتي لم يكن دارون يراها تحت المجهر -في أيَّامه- إلَّا كلَطْخةٍ بسيطةٍ!
9:40
إذن؛ فالانتخاب الطَّبيعيُّ كما يصوِّره دارون هو أيضًا خرافةٌ.
9:45
على هذه الخرافات السَّاقطة عقلًا وحسًّا وتجربةً
9:48
أقام دارون أسخف وأغبى فكرةٍ في التَّاريخ:
9:53
أنَّ كلَّ ما نرى من إحكامٍ وإتقانٍ في هذا الخَلْق؛ إنَّما جاء بالصُّدَف دون قصدٍ
9:59
ولا يحتاج علمًا ولا حكمةً!
10:01
ماذا بقي من نظريَّة دارون إذن؟!
10:04
بقيت خيالاتُه الَّتي تُشبه أن تكون مساهَمةً منه في مسابقةٍ بعنوان: أوسع خيالٍ
10:11
يتبارى فيها علماء الطَّبيعة في إضحاك المستمِعين.
10:14
بقي خياله الَّذي يُشبه قصص ما قبل النَّوم عن الأمير الضِّفدع والأميرة البجعة،
10:20
وفئران سندريلَّا الَّذين تحوَّلوا إلى حُصُنٍ جميلةٍ!
10:24
لكن مع إضافةٍ واحدةٍ أنَّ ذلك احتاج وقتًا طويلًا جدًّا!
10:30
الخيال الَّذي يضع ريشًا على الدَّيناصورات وهي تُطارد البعوض فتطير.
10:35
والخيال الَّذي قفز إلى ذهن دارون حول الدُّبِّ الأسود وهو يسبح لساعاتٍ في المياه
10:40
فاتحًا فمه ليُدخِل أكبر عددٍ ممكنٍ من الحشرات فيه،
10:44
فذكَّره بالحوت الَّذي يفتح فمه لتدخل فيه الأسماك،
10:49
وما دام هناك شبهٌ؛ فيبدو أنَّ الحوت تطوَّر عن الدُّبِّ في منطق دارون!
10:55
كما في نسخة "الفاكس ميلي" لطبعته الأولى من كتابه (أصل الأنواع) صفحة 184.
11:01
سيقول قائلٌ: لكن ماذا عن عِلم دارون؟!
11:04
ماذا عن المشاهَدات الكثيرة الَّتي جمعها في كتابه، وعن دقَّة ملاحظته؟!
11:09
فنقول: دارون كان أشبه ببرنامج، فيه الكثير من المدخَلات،
11:15
إنَّما المعادلة الَّتي تربط بين هذه المدخلات خاطئةٌ، فتعطيَ نتيجةً خاطئةً؛
11:21
لذلك لم ينفع دارون كثرة معلوماته، ولا سعة اطّلاعه.
11:26
من المهمِّ جدًّا -إخواني-
11:27
أن نفهم أنَّ هذه المشاهدات للطُّيور والزَّواحف والحشرات وغيرها
11:31
ليست جزءًا من نظريَّة التَّطوُّر،
11:34
إنَّما كلامنا عن النَّظريَّة الَّتي ادَّعى دارون أنَّها تفسيرٌ لهذه المشاهدات.
11:40
فيما عدا المشاهَدات، وصياغته لمصطلح الانتخاب الطَّبيعيِّ -خاطئ الدَّلالة عنده-
11:45
فإنَّ جديد دارون ليس صحيحًا، وصحيحه ليس جديدًا.
11:50
نعم؛ جديد دارون ليس صحيحًا وصحيحه ليس جديدًا.
11:56
لذلك -إخواني- فمن الخطأ أن يُقال: "نظريَّة دارون كان بها أخطاء"؛
12:01
بل نظريَّة دارون هي أصلًا مجموعةٌ من الأخطاء؛
12:04
خرافاتٌ أبطَلَها العقل والعلم، ومغالطاتٌ منطقيَّةٌ، وخيالاتٌ سخيفةٌ
12:10
للتَّوصُّل إلى نتيجة أنَّ الإتقان والإحكام في الكائنات
12:13
لا يحتاج قصدًا ولا إرادةً ولا علمًا!
12:18
أُعيد التَّذكير -إخواني- بأنَّ حلقاتنا هي حلقاتٌ منهجيَّةٌ لضبط البوصلة،
12:23
قاعدةٌ منهجيَّةٌ تعلَّمناها اليوم: أنَّ الباطل لا يقوم إلَّا على باطل،
12:27
ولا يمكن أن يستند إلى علمٍ صحيحٍ أو عقلٍ سليمٍ،
12:31
وحيثما طبَّقتَ هذه القاعدة فستجدها منطبِقةً؛
12:35
رأينا نموذجًا منها اليوم مع خرافة دارون "أنَّ الكائنات جاءت بالصُّدف"!
12:41
سيتساءل البعض: لكنْ ألم يَسُدَّ مَن بعدَ دارون ثغرات النظريَّة، ويصحِّحوا أخطاءها؟!
12:49
ما ردُّك على الأدلَّة من الأحافير؟! من البيولوجيا الجُزيئيَّة؟!
12:53
من علم الأجِنَّة؟! من الأعضاء الضَّامرة؟!
12:56
ألا يمكن التَّوفيق بين النَّظريَّة ووجود الله؟
12:59
إن كانت خرافةً -كما تقول- فلماذا يؤمن بها أكثر العلماء الغربيِّين؟!
13:05
سنُجيب -إخواني- وبشكلٍ منهجيٍّ بإذن الله،
13:08
وسنبدأ بدعوى سدِّ الثَّغرات وتصحيح الأخطاء
13:12
وهو موضوع حلقتنا القادمة المهمَّة،
13:14
فتابعوا معنا...
13:16
وبالله وحده التَّوفيق.
13:17
والسَّلام عليكم ورحمة الله..`;

function removeFromArr(arr,index,item = null) {
    arr = JSON.stringify(arr);
    arr = JSON.parse(arr);
    
    let turn;
    
    if(item != null) {
        index = arr.indexOf(item);
    }
    
    if(index <= arr.length-1 && index > -1) {
        arr.splice(index, 1);
        turn = arr;
    } else {
        turn = arr;
    }
    
    return turn;
}

// longTxt = longTxt.split("\n");
// let i = 0;
// while (i < longTxt.length/2) {
//     longTxt = removeFromArr(longTxt, i);
//     i++;
// }
// console.log(longTxt.join("\n"));



function search2D(arr, item, column_search = 0, column_result = 1) {
    let res = [];
    let i = 0;
    while(i < arr.length) {
        if(arr[i][column_search] == item)
            res.push(arr[i][column_result]);
        i++;
    }

    return res;
}

let namesFiles = [["a", 0], ["v", 1], ["b", 2]];
let course = "v";
// ==> res = 1;
console.log(search2D(namesFiles, course)[0]);
